# Задание 11
# https://tproger.ru/problems/python-3-exercises-for-beginners-geekbrains/
# Выведите первый и последний элемент списка.
def task_11():
    var_list = [x for x in range(10)]
    print(f'Первый: {var_list[0]}, последний: {var_list[-1]}')
